In [1]:
import numpy as np
import pandas as pd

# Lembrandounique

In [34]:
np.random.seed(42)
df = np.random.randint(-10, 10, (5,4))
indices = ["A","B","C","D","E"]
columns = ["W","X","Y","Z"]
df = pd.DataFrame(df, indices, columns)
df

    W  X  Y  Z
A  -4  9  4  0
B  -3 -4  8  0
C   0 -7 -3 -8
D  -9  1 -5 -9
E -10  1  1  6

In [35]:
df[["W","Z"]].loc[["A","C"]]

   W  Z
A -4  0
C  0 -8

In [36]:
df = df[df > -4]
df

     W    X    Y    Z
A  NaN  9.0  4.0  0.0
B -3.0  NaN  8.0  0.0
C  0.0  NaN -3.0  NaN
D  NaN  1.0  NaN  NaN
E  NaN  1.0  1.0  6.0

In [82]:
df.dropna(axis=1,thresh=3).fillna(df.std())

          X         Y         Z
A  9.000000  4.000000  0.000000
B  4.618802  8.000000  0.000000
C  4.618802 -3.000000  3.464102
D  1.000000  4.654747  3.464102
E  1.000000  1.000000  6.000000

In [101]:
df = pd.DataFrame({"City":["NY", "WA", "NY", "AT", "SF"], "Hab":[100, 200, 300,200 ,500]}, ["1st", "2nd", "3rd", "4th", "5th"])
df

    City  Hab
1st   NY  100
2nd   WA  200
3rd   NY  300
4th   AT  200
5th   SF  500

In [103]:
df["EncodedCity"] = df["City"].map({v:k for k, v in dict(df.reset_index()["City"]).items()})
df

    City  Hab  EncodedCity
1st   NY  100            2
2nd   WA  200            1
3rd   NY  300            2
4th   AT  200            3
5th   SF  500            4

# Testando

In [107]:
df = pd.read_csv("additional/african_econ_crises.csv")
df.head()

,case,cc3,country,year,systemic_crisis,exch_usd,domestic_debt_in_default,sovereign_external_debt_default,gdp_weighted_default,inflation_annual_cpi,independence,currency_crises,inflation_crises,banking_crisis
0,1,DZA,Algeria,1870,1,0.052264,0,0,0.0,3.441456,0,0,0,crisis
1,1,DZA,Algeria,1871,0,0.052798,0,0,0.0,14.149140,0,0,0,no_crisis
2,1,DZA,Algeria,1872,0,0.052274,0,0,0.0,-3.718593,0,0,0,no_crisis
3,1,DZA,Algeria,1873,0,0.051680,0,0,0.0,11.203897,0,0,0,no_crisis
4,1,DZA,Algeria,1874,0,0.051308,0,0,0.0,-3.848561,0,0,0,no_crisis

In [110]:
countries = df["country"].unique()
amount_of_countries = len(countries)
amount_of_countries

13

In [118]:
df.loc[df["inflation_annual_cpi"].idxmax()]

case                                        70
cc3                                        ZWE
country                               Zimbabwe
year                                      2008
systemic_crisis                              1
exch_usd                                 0.002
domestic_debt_in_default                     1
sovereign_external_debt_default              1
gdp_weighted_default                       0.0
inflation_annual_cpi               21989695.22
independence                                 1
currency_crises                              1
inflation_crises                             1
banking_crisis                          crisis
Name: 1053, dtype: object

In [124]:
df[(df["country"] == "Kenya") & (df["systemic_crisis"] == 1)].sort_values("year", ascending=True).head(1)

,case,cc3,country,year,systemic_crisis,exch_usd,domestic_debt_in_default,sovereign_external_debt_default,gdp_weighted_default,inflation_annual_cpi,independence,currency_crises,inflation_crises,banking_crisis
475,35,KEN,Kenya,1985,1,16.2843,0,0,0.0,11.398,1,0,0,crisis

In [139]:
df.groupby("country").sum()["systemic_crisis"]

country
Algeria                      4
Angola                       0
Central African Republic    19
Egypt                        6
Ivory Coast                  4
Kenya                       13
Mauritius                    0
Morocco                      2
Nigeria                     10
South Africa                 0
Tunisia                      5
Zambia                       4
Zimbabwe                    15
Name: systemic_crisis, dtype: int64

In [145]:
df[(df["country"] == "Zimbabwe")&(df["sovereign_external_debt_default"])].sum()["sovereign_external_debt_default"]

30

In [151]:
df.iloc[df[(df["country"] == "Algeria")]["exch_usd"].idxmax()]

case                                       1
cc3                                      DZA
country                              Algeria
year                                    2014
systemic_crisis                            0
exch_usd                           87.970698
domestic_debt_in_default                   0
sovereign_external_debt_default            0
gdp_weighted_default                     0.0
inflation_annual_cpi                   2.917
independence                               1
currency_crises                            0
inflation_crises                           0
banking_crisis                     no_crisis
Name: 84, dtype: object